#include <iostream>
using namespace std;

int main() {
    int n;
    int m;

    // Въвеждане на размерите на двумерния масив
    cout << "Въведете брой редове n: ";
    cin >> n;

    cout << "Въведете брой колони m: ";
    cin >> m;

    // Въвеждане на елементите на двумерния масив
    int A[n][m];
    cout << "Въведете елементите на двумерния масив:" << endl;
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cout << "A[" << i << "][" << j << "]: ";
            cin >> A[i][j];
        }
    }

    // Изчисляване на произведението на елементите с положителна стойност на колоните с нечетни индекси
    int end = 1;
    for (int j = 1; j < m; j += 2) {
        for (int i = 0; i < n; ++i) {
            if (A[i][j] > 0) {
                end *= A[i][j];
            }
        }
    }

    // Извеждане на резултата
    cout << "Произведението на елементите с положителна стойност на колоните с нечетни индекси е: " << end << endl;

    return 0;
}
